package com.maplef.变量与运算符;

/**
 * Created with IntelliJ IDEA.
 *
 * @Author: fxiao
 * @Version: 2021/09/17/0:39
 */
public class 位运算符 {

    /*
    A = 0011 1100
    B = 0000 1101

    ---------------

    A&B = 0000 1100 //对二进制数进行对比,当左右两边的位数相同,且为1时,得到1
    A|B = 0011 1101 //对二进制数进行对比,当左右两边的位数相同,且都为0,得到0,否则得1
    //可以理解为对二进制数的每一位进行&&和||比较并得出值
    A^B = 0011 0001 //对二进制数进行对比,当左右两边的位数相同,且值相同则为0,否则为1
    ~B = 1111 0010  //就是对&的取反操作


    ----------------
    2*8 = 16 (2*2*2*2)

    <<   表示在二进制的情况下,位数往左位移一位。在数学中就代表 *2
    >>   表示在二进制的情况下,位数往右位移一位。在数学中就代表 /2
    >>和<<对数进行操作的时候,需要在后面添加一个数字

    记住:二进制位数往左位移一位代表*2,右位移一位代表/2

    因为是直接对二进制数进行操作,所以它的效率极高!!!!!
     */

    public static void main(String[] args) {

        System.out.println(2<<3);
        System.out.println(1<<4);
        //例如这里,就代表二进制位数往左位移3位,在数学中就表示 *2*2*2
    }

}
